#+title: 'Deep Learning with Pytorch' Notes
#+STARTUP: show2levels
#+OPTIONS: :toc:2

** Getting a pre-trained model for /image recognition/
- Some good models include:
  + AlexNet, ResNet, and Inception v3

Models can be found within torchvision.models, theres a bunch of them
#+begin_src python :results output  :tangle HW2/notes.py
from torchvision import models
list_models = dir(models)
print("Num of models: ", len(list_models))
print(list_models[0:5])
print(list_models[170:175])
#+end_src

#+RESULTS:
: Num of models:  205
: ['AlexNet', 'AlexNet_Weights', 'ConvNeXt', 'ConvNeXt_Base_Weights', 'ConvNeXt_Large_Weights']
: ['resnet50', 'resnext101_32x8d', 'resnext101_64x4d', 'resnext50_32x4d', 'segmentation']

- *NOTE*: Notice how theres both uppercase / lowercase models?
  + Uppercase represent classes that implement varying amount of models
  + Lowercase represent /convince/ functions that return an instance of that model type
    * ex. 'resnet50' returns an instance of model 'resnet' with 50 layers

